{
  "backend/main.mo": "Actor implementing user profiles, visa records, and per-user application status storage with authorization checks.",
  "feature_evidence.json": "Feature evidence report mapping features to affected files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of all frontend source files.",
  "frontend/index.css": "Tailwind base styles defining OKLCH color variables and light/dark mode theme tokens.",
  "frontend/index.html": "HTML entry point that loads the React application into the root container.",
  "frontend/src/App.tsx": "Main app component controlling routing, authentication flow, and profile setup gating.",
  "frontend/src/components/layout/AppLayout.tsx": "Layout wrapper providing header, footer, and page structure.",
  "frontend/src/components/layout/Footer.tsx": "Footer displaying copyright and caffeine.ai attribution with dynamic year.",
  "frontend/src/components/layout/Header.tsx": "Header with navigation, login/logout handling, and authenticated user display.",
  "frontend/src/components/profile/ProfileSetupModal.tsx": "Modal prompting new authenticated users to enter and submit their profile name.",
  "frontend/src/components/reminders/ReminderManager.tsx": "UI component for adding, removing, and listing preset or custom reminder timestamps tied to an expiry date.",
  "frontend/src/components/reminders/UpcomingReminders.tsx": "Fetches upcoming reminders, flattens and sorts them, and displays overdue and upcoming reminders in alerts.",
  "frontend/src/components/status/ApplicationStatusManager.tsx": "Manages creation, editing, and deletion of application status entries with forms, dialogs, and backend mutations.",
  "frontend/src/components/visa/VisaRecordForm.tsx": "Form for creating or editing visa records, including handling expiry dates and reminder configuration.",
  "frontend/src/components/visa/VisaRecordList.tsx": "Displays all visa records with expiry indicators and provides edit and delete actions.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to the user's identity and refreshes dependent queries when identity changes.",
  "frontend/src/hooks/useHashRoute.ts": "Simple hash-based router hook returning the current route and a setter to update window.location.hash.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements a React context and provider for managing Internet Identity authentication, exposing identity state, login, and logout helpers.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for fetching and mutating user profiles, visa records, reminders, and application statuses through an actor API.",
  "frontend/src/index.css": "Defines Tailwind CSS layers and custom theme variables for light and dark modes.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AustralianVisaCheckPage.tsx": "Renders a form for checking an Australian visa application status and displays the result using application status API hooks.",
  "frontend/src/pages/DashboardPage.tsx": "Provides a dashboard with tabs to manage visa records, reminders, and application statuses, including a form for adding or editing records.",
  "frontend/src/pages/LandingPage.tsx": "Displays the marketing landing page with a login button and navigation to visa status checking, highlighting app features.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading URL and hash params, persisting them in sessionStorage, and removing them from the URL.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, colors, typography, animations, and enabled plugins.",
  "project_state.json": "Defines the project’s current state, features, risks, and architectural notes for expanding VisaTrack with a mock visa check module."
}