{
  "backend/main.mo": "Motoko canister implementing user profiles, visa records, and per-user application status management with access control enforcement.",
  "feature_evidence.json": "Defines feature evidence for removing the disclaimer block from the Australian Visa Status Check page and lists affected files and metadata.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of major frontend files describing routing, components, pages, and hooks.",
  "frontend/index.css": "Tailwind base styles and CSS variables defining the application's color system for light and dark modes.",
  "frontend/index.html": "Basic HTML entry point that mounts the React app and loads main.tsx.",
  "frontend/src/App.tsx": "Main React component handling authentication state, hash routing, and conditional rendering of landing, dashboard, profile setup, or visa check pages.",
  "frontend/src/components/layout/AppLayout.tsx": "Layout wrapper providing a header, main content container, and footer.",
  "frontend/src/components/layout/Footer.tsx": "Footer displaying copyright info and a Caffeine.ai attribution link.",
  "frontend/src/components/layout/Header.tsx": "Header with navigation, branding, login/logout controls, and optional user profile display.",
  "frontend/src/components/profile/ProfileSetupModal.tsx": "Modal prompting authenticated users to enter and save their name during initial profile setup.",
  "frontend/src/components/reminders/ReminderManager.tsx": "Component for adding, removing, and listing preset or custom reminder dates tied to visa expiry.",
  "frontend/src/components/reminders/UpcomingReminders.tsx": "Displays upcoming and overdue reminders by flattening visa records and sorting reminder timestamps, showing badges and dates.",
  "frontend/src/components/status/ApplicationStatusManager.tsx": "Manages creation, editing, and deletion of application statuses with form dialogs and table display using query hooks.",
  "frontend/src/components/visa/VisaRecordForm.tsx": "Form dialog for creating or editing visa records, including expiry handling and reminder management.",
  "frontend/src/components/visa/VisaRecordList.tsx": "Lists visa records with edit/delete actions and expiry status indicators, loading and empty states.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor based on Internet Identity, invalidating and refetching queries when identity changes.",
  "frontend/src/hooks/useHashRoute.ts": "Manages simple hash-based routing between 'home' and 'visa-check' states.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity context, handling login, stored identity loading, status tracking, and AuthClient setup.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for fetching and mutating user profiles, visa records, reminders, and application statuses using an actor API.",
  "frontend/src/index.css": "Defines Tailwind CSS base layers and custom CSS variables for light and dark themes, including color palettes and global styles.",
  "frontend/src/main.tsx": "Bootstraps the React app by rendering App within QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AustralianVisaCheckPage.tsx": "Implements a form page for checking Australian visa application status using a mutation hook and displays results or errors.",
  "frontend/src/pages/DashboardPage.tsx": "Renders the main dashboard with tabs for visa records and application status management, including forms and reminders.",
  "frontend/src/pages/LandingPage.tsx": "Displays the marketing landing page with hero content, feature cards, and login or visa‑check navigation actions.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading, storing, and clearing URL and session parameters to support routing and persistent state.",
  "frontend/tailwind.config.js": "Tailwind config enabling dark mode, custom color system using OKLCH vars, extended typography, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project metadata detailing features, architectural notes, compliance considerations, and current state for the VisaTrack app."
}