{
  "backend/main.mo": "Actor implementing user profiles, visa records, and application status management with access control and normalization utilities.",
  "feature_evidence.json": "Feature evidence report mapping feature IDs to affected files, components, and tests with confidence levels.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of each frontend file in the project.",
  "frontend/index.css": "Tailwind base and theme variables defining color tokens, dark mode values, and global styles.",
  "frontend/index.html": "HTML entry point providing the root element and loading the Vite React app.",
  "frontend/src/App.tsx": "Top-level app component handling routing, authentication states, profile setup, and global error boundaries.",
  "frontend/src/components/errors/AppErrorBoundary.tsx": "React error boundary showing a user-friendly fallback card and logging errors to the console.",
  "frontend/src/components/layout/AppLayout.tsx": "Layout wrapper that renders a header, main content area, and footer.",
  "frontend/src/components/layout/Footer.tsx": "Footer displaying copyright, attribution, and a link to caffeine.ai with UTM tracking.",
  "frontend/src/components/layout/Header.tsx": "Header with navigation, login/logout handling, user avatar display, and hash‑based route controls.",
  "frontend/src/components/profile/ProfileSetupModal.tsx": "Modal prompting authenticated users to enter and save their name on first login.",
  "frontend/src/components/reminders/ReminderManager.tsx": "Component for adding, removing, and displaying preset or custom reminder timestamps for a visa expiry date.",
  "frontend/src/components/reminders/UpcomingReminders.tsx": "Fetches upcoming reminders, determines overdue status, and displays them in a sorted list with contextual badges.",
  "frontend/src/components/status/ApplicationStatusManager.tsx": "Manages creation, editing, and deletion of application status records with file upload and confirmation dialogs.",
  "frontend/src/components/visa/VisaRecordForm.tsx": "Form for creating or editing visa records, including expiry dates, conditions, and reminder management.",
  "frontend/src/components/visa/VisaRecordList.tsx": "Displays all visa records with expiry indicators and allows editing or deleting individual entries.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity and refreshes dependent queries when identity changes.",
  "frontend/src/hooks/useBlobObjectUrl.ts": "Generates and cleans up object URLs from binary data for displaying files like PDFs.",
  "frontend/src/hooks/useHashRoute.ts": "Simple hash-based router that tracks and updates the current route based on URL hash changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity authentication via AuthClient, exposing identity state and login/logout helpers.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating user profiles, visa records, reminders, and application status through the backend actor.",
  "frontend/src/index.css": "Sets up TailwindCSS base layers and defines light/dark theme CSS variables for colors and layout styling.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AustralianVisaCheckPage.tsx": "Implements a form-driven page to check visa application status and display results, including PDF viewing and downloading.",
  "frontend/src/pages/DashboardPage.tsx": "Provides a tabbed dashboard for managing visa records, reminders, and application status entries with create/edit functionality.",
  "frontend/src/pages/LandingPage.tsx": "Displays the marketing landing page with login and visa status check entry points.",
  "frontend/src/utils/applicationStatusNormalization.ts": "Normalizes application ID and email inputs to consistent trimmed and lowercase values for backend lookups.",
  "frontend/src/utils/getApplicationStatusResult.ts": "Normalizes varied backend response shapes into a clean ApplicationStatus or null.",
  "frontend/src/utils/urlParams.ts": "Utility module for reading URL parameters, persisting them in sessionStorage, and clearing them from URL hashes. Supports both standard and hash-based routing.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme colors, spacing, typography, animations, and plugins with extended design tokens. Enables dark mode, container settings, and custom utilities.",
  "project_state.json": "Project state file tracking versioned requirements, architectural notes, known issues, and existing features. Highlights ongoing bugs related to the Australian Visa Check lookup."
}