{
  "backend/main.mo": "Main backend actor implementing visa record and application status management with role-based access control, storing per-user data in maps and providing CRUD operations for visa records, application statuses with PDF attachments, and user profiles.",
  "feature_evidence.json": "Feature evidence report documenting three high-confidence features related to investigating, fixing, and adding error logging for PDF attachment display issues in the PdfAttachmentSection component.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files describing components, hooks, pages, and utilities with emphasis on PDF byte integrity logging, React Query integration, and hash-based routing.",
  "frontend/index.css": "Global Tailwind CSS styles defining OKLCH-based color system with CSS custom properties for light and dark themes, including neutral palette, primary colors, and sidebar variables.",
  "frontend/index.html": "HTML entry point for the VisaTrack React application with root div and module script reference to main.tsx.",
  "frontend/src/App.tsx": "Root application component with hash-based routing that conditionally renders LandingPage, AustralianVisaCheckPage, ProfileSetupModal, or DashboardPage based on route and authentication state, wrapped in AppErrorBoundary.",
  "frontend/src/components/errors/AppErrorBoundary.tsx": "React error boundary component that catches and displays application errors with a user-friendly card UI and refresh button.",
  "frontend/src/components/layout/AppLayout.tsx": "Layout wrapper component providing consistent Header, main content area, and Footer structure across all pages.",
  "frontend/src/components/layout/Footer.tsx": "Footer component displaying copyright notice and Caffeine.ai attribution with UTM tracking parameters.",
  "frontend/src/components/layout/Header.tsx": "Application header with logo, hash-based navigation to Visa Check page, user profile avatar with initials, and login/logout functionality using Internet Identity.",
  "frontend/src/components/profile/ProfileSetupModal.tsx": "Modal dialog for first-time user profile setup that prompts authenticated users to enter their name before accessing the dashboard, with form validation and mutation handling.",
  "frontend/src/components/reminders/ReminderManager.tsx": "A React component that manages visa expiry reminders, allowing users to add preset reminders (30, 14, 7 days before expiry), custom date reminders, and displays/removes active reminders with timestamps stored as bigints.",
  "frontend/src/components/reminders/UpcomingReminders.tsx": "Displays a card showing upcoming visa reminders for the next 30 days, highlighting overdue reminders and showing days remaining for each, sorted by date with visual alerts.",
  "frontend/src/components/status/ApplicationStatusManager.tsx": "A comprehensive CRUD interface for managing visa application statuses with PDF attachment support, including form dialogs for create/edit, delete confirmations, and a table view with PDF preview/download functionality.",
  "frontend/src/components/status/PdfAttachmentSection.tsx": "Renders PDF attachment previews in an iframe with extensive diagnostic logging, error handling for validation failures, and provides view/download buttons with fallback options for corrupted files.",
  "frontend/src/components/visa/VisaRecordForm.tsx": "A dialog form component for creating and editing visa records with fields for label, grant reference, expiry date, conditions, and integrated reminder management using ReminderManager component.",
  "frontend/src/components/visa/VisaRecordList.tsx": "Displays a grid of visa record cards with expiry status badges (expired/expiring soon), showing visa details and providing edit/delete actions with confirmation dialogs.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages an authenticated or anonymous actor instance using Internet Identity, initializes access control with admin token from URL params, and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useActorReadiness.ts": "React hook that wraps useActor to provide UI-gating readiness state (isInitializing, isReady, hasError) with developer diagnostics logging for actor initialization status.",
  "frontend/src/hooks/useBlobObjectUrl.ts": "React hook that creates and manages Blob/Object URLs from binary data with PDF validation, automatic cleanup, and signature-based change detection to prevent unnecessary regeneration when content is unchanged.",
  "frontend/src/hooks/useHashRoute.ts": "React hook that manages hash-based routing between 'home' and 'visa-check' routes using window.location.hash and hashchange events.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication, managing login/logout flow, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for user profiles, visa records, and application statuses, providing CRUD operations with automatic cache invalidation and actor dependency management.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables defining light and dark theme color palettes using OKLCH color space with warm undertones and deep navy primary colors.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClientProvider for data fetching and InternetIdentityProvider for authentication context.",
  "frontend/src/pages/AustralianVisaCheckPage.tsx": "Page component for checking Australian visa application status by application ID and email, displaying results with PDF attachment viewing, approval status, and technical diagnostics with signature-based change detection.",
  "frontend/src/pages/DashboardPage.tsx": "Main dashboard page component with tabs for visa records and status management, includes form dialog for adding/editing records and displays upcoming reminders.",
  "frontend/src/pages/LandingPage.tsx": "Landing page with hero section, feature cards, and call-to-action buttons for login and visa status checking.",
  "frontend/src/utils/anonymousActor.ts": "Creates and caches an anonymous actor instance for unauthenticated read-only operations like checking application status.",
  "frontend/src/utils/applicationStatusNormalization.ts": "Normalizes application status identifiers by trimming whitespace and lowercasing email for consistent backend lookups.",
  "frontend/src/utils/bytesSignature.ts": "Computes FNV-1a hash signature from byte arrays to detect PDF content changes without comparing entire arrays.",
  "frontend/src/utils/candidOption.ts": "Utility functions to unwrap Candid optional encodings (null, arrays, discriminated unions) and normalize bytes/strings.",
  "frontend/src/utils/getApplicationStatusResult.ts": "Normalizes raw backend ApplicationStatus responses, ensuring bytes are Uint8Array and providing sensible defaults for optional fields.",
  "frontend/src/utils/pdfAttachment.ts": "Validates PDF bytes by checking for PDF header and EOF marker, provides utilities for viewing and downloading PDFs from in-memory bytes.",
  "frontend/src/utils/statusCheckError.ts": "Parses and categorizes status check errors into connection, backend, or unknown types with user-friendly messages and technical details.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color schemes using OKLCH color space, typography, container queries, animations, and extended theme utilities.",
  "project_state.json": "Project metadata tracking a fix request for PDF display issues in approved applications, including existing features for investigation, fixing, and error logging."
}