{
  "backend/main.mo": "Main Motoko actor implementing visa record management, application status tracking, and user profile management with role-based access control (admin/user permissions) and per-user data scoping.",
  "feature_evidence.json": "Feature evidence report documenting that AustralianVisaCheckPage displays applicant name, visa type, status, and approval date in Australian Government website style with high confidence.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files including routing, hooks, pages, components, and utilities with emphasis on Australian Government styling and visa status checking functionality.",
  "frontend/index.css": "Global Tailwind CSS styles with OKLCH-based color system defining light and dark mode CSS variables for the design system including Australian Government color palette.",
  "frontend/index.html": "HTML entry point for the VisaTrack React application with root div and module script reference.",
  "frontend/src/App.tsx": "Root React component implementing hash-based routing between LandingPage, AustralianVisaCheckPage, ProfileSetupModal, and DashboardPage with authentication state management and error boundary wrapper.",
  "frontend/src/components/errors/AppErrorBoundary.tsx": "React error boundary component that catches and displays application errors with a user-friendly card UI and page refresh option.",
  "frontend/src/components/layout/AppLayout.tsx": "Layout wrapper component providing consistent Header, main content area, and Footer structure across all pages.",
  "frontend/src/components/layout/Footer.tsx": "Footer component displaying copyright notice and Caffeine.ai attribution with UTM tracking parameters.",
  "frontend/src/components/layout/Header.tsx": "Application header with logo, navigation to Visa Check page, user profile avatar with initials, and login/logout button with Internet Identity integration.",
  "frontend/src/components/profile/ProfileSetupModal.tsx": "Modal dialog for first-time authenticated users to enter their name and create a user profile before accessing the dashboard.",
  "frontend/src/components/reminders/ReminderManager.tsx": "Component for managing visa expiry reminders with preset (30/14/7 days before) and custom date options. Handles adding, removing, and displaying reminder timestamps as badges.",
  "frontend/src/components/reminders/UpcomingReminders.tsx": "Displays upcoming reminders for the next 30 days in a card layout, showing overdue status, days until reminder, and associated visa details. Fetches data using useGetUpcomingReminders hook.",
  "frontend/src/components/status/ApplicationStatusManager.tsx": "Authenticated component for CRUD operations on application status entries with email/ID normalization. Includes form for creating/editing statuses and list view with delete functionality.",
  "frontend/src/components/status/PdfAttachmentSection.tsx": "Displays PDF attachments with iframe preview and download functionality. Includes comprehensive validation, error handling, and diagnostic logging for PDF rendering issues.",
  "frontend/src/components/visa/VisaRecordForm.tsx": "Dialog form for creating and editing visa records with fields for label, grant reference, expiry date, conditions, and integrated ReminderManager component. Handles form submission with validation and toast notifications.",
  "frontend/src/components/visa/VisaRecordList.tsx": "Displays grid of visa record cards with expiry status badges (expired/expiring soon), edit/delete actions, and empty state. Includes confirmation dialog for deletions.",
  "frontend/src/hooks/useActor.ts": "React hook that manages the backend actor instance using React Query, creating authenticated or anonymous actors based on Internet Identity state and initializing access control with an admin token from URL parameters.",
  "frontend/src/hooks/useActorReadiness.ts": "React hook that wraps useActor to provide UI-friendly readiness states (isInitializing, isReady, hasError) with diagnostic logging for actor initialization status.",
  "frontend/src/hooks/useBlobObjectUrl.ts": "React hook that creates and manages Blob/Object URLs from binary data with extensive diagnostic logging, signature-based change detection, PDF validation, and automatic cleanup of revoked URLs.",
  "frontend/src/hooks/useHashRoute.ts": "React hook that manages hash-based routing between 'home' and 'visa-check' routes using window.location.hash and hashchange events.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication, managing AuthClient lifecycle, login/logout flows, identity persistence, and providing authentication status states.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for backend operations including user profiles, visa records CRUD, upcoming reminders, and application status checks with automatic cache invalidation.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables defining light/dark theme color palettes using OKLCH color space, including Australian Government brand colors (navy, blue, orange).",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClientProvider for React Query and InternetIdentityProvider for authentication context.",
  "frontend/src/pages/AustralianVisaCheckPage.tsx": "Public visa status check page styled to match Australian Government Department of Home Affairs website, featuring a dark navy header with coat of arms, navigation, and a collapsible VEVO form for checking application status by ID and email.",
  "frontend/src/pages/DashboardPage.tsx": "Main dashboard page component with tabs for visa records and status management, including forms for adding/editing records and displaying upcoming reminders.",
  "frontend/src/pages/LandingPage.tsx": "Landing page with hero section, feature cards, and call-to-action buttons for login and visa status checking.",
  "frontend/src/utils/anonymousActor.ts": "Creates and caches an anonymous actor for unauthenticated read-only operations like querying application status.",
  "frontend/src/utils/applicationStatusNormalization.ts": "Normalizes application ID and email inputs by trimming whitespace and lowercasing email for consistent backend lookups.",
  "frontend/src/utils/bytesSignature.ts": "Computes deterministic FNV-1a hash signatures from byte arrays with comprehensive diagnostic logging.",
  "frontend/src/utils/candidOption.ts": "Utility functions to unwrap Candid optional types and normalize bytes/strings from various formats into standard types.",
  "frontend/src/utils/getApplicationStatusResult.ts": "Normalizes raw backend getApplicationStatus responses into properly typed ApplicationStatus objects with Uint8Array conversion for attachments.",
  "frontend/src/utils/pdfAttachment.ts": "Validates PDF files by checking headers and EOF markers, and provides functions to open or download PDFs from byte arrays.",
  "frontend/src/utils/statusCheckError.ts": "Parses and categorizes errors from status checks into structured error models with user-friendly messages and debugging details.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color schemes (including government branding colors using OKLCH), typography, animations, and container settings for the application.",
  "project_state.json": "Project state file tracking the visa status lookup application's features, requirements, and pending requests to display applicant details for specific reference numbers and emails."
}