{
  "backend/main.mo": "Main Motoko actor implementing visa record and application status management with role-based access control, user profiles, and PDF attachment storage. Includes CRUD operations for visa records and application statuses scoped per user principal.",
  "feature_evidence.json": "Feature evidence report documenting the removal of PDF attachment display from ApplicationStatusManager UI while preserving backend storage functionality.",
  "frontend-file-summaries.txt": "Pre-existing summaries of frontend files describing routing, hooks, pages, components, and utilities including the ApplicationStatusManager without PDF display and normalization utilities.",
  "frontend/index.css": "Global Tailwind CSS styles with OKLCH color system defining CSS custom properties for light and dark themes including background, foreground, primary, secondary, and chart colors.",
  "frontend/index.html": "HTML entry point for the VisaTrack React application with root div and module script reference to main.tsx.",
  "frontend/src/App.tsx": "Root React component with hash-based routing, authentication checks, and conditional rendering of LandingPage, AustralianVisaCheckPage, ProfileSetupModal, or DashboardPage wrapped in AppErrorBoundary.",
  "frontend/src/components/errors/AppErrorBoundary.tsx": "React error boundary component that catches and displays errors with a refresh button in a styled card layout.",
  "frontend/src/components/layout/AppLayout.tsx": "Layout wrapper component providing consistent Header, main content area, and Footer structure across pages.",
  "frontend/src/components/layout/Footer.tsx": "Footer component displaying copyright notice and Caffeine.ai attribution with UTM tracking parameters.",
  "frontend/src/components/layout/Header.tsx": "Application header with logo, navigation to Visa Check page, user profile avatar with initials, and login/logout button with authentication state management.",
  "frontend/src/components/profile/ProfileSetupModal.tsx": "Modal dialog for first-time user profile setup prompting authenticated users to enter their name before accessing the dashboard.",
  "frontend/src/components/reminders/ReminderManager.tsx": "A React component that manages visa expiry reminders, allowing users to add preset reminders (30, 14, 7 days before expiry), custom date reminders, and remove existing reminders. Handles timestamp conversion to/from bigint nanoseconds and displays active reminders as badges.",
  "frontend/src/components/reminders/UpcomingReminders.tsx": "Displays a card showing upcoming reminders for the next 30 days, highlighting overdue reminders with destructive styling. Fetches reminder data via useGetUpcomingReminders hook and flattens/sorts reminders across all visa records.",
  "frontend/src/components/status/ApplicationStatusManager.tsx": "Authenticated component for CRUD operations on application status entries with email/ID normalization. Provides a form for creating/editing statuses and a list view with edit/delete actions, using React Query mutations and normalized keys.",
  "frontend/src/components/status/PdfAttachmentSection.tsx": "Displays PDF attachments with iframe preview and download functionality, including comprehensive error handling and validation. Uses blob object URLs and provides fallback download option when preview fails.",
  "frontend/src/components/visa/VisaRecordForm.tsx": "A dialog form component for creating and editing visa records with fields for label, grant reference, expiry date, conditions, and reminders. Integrates ReminderManager component and handles timestamp conversion to bigint nanoseconds.",
  "frontend/src/components/visa/VisaRecordList.tsx": "Displays a grid of visa record cards with expiry status badges (expired/expiring soon), edit/delete actions, and formatted dates. Shows empty state when no records exist and uses AlertDialog for delete confirmation.",
  "frontend/src/hooks/useActor.ts": "React hook that manages the backend actor instance using React Query, creating authenticated or anonymous actors based on Internet Identity state and initializing access control with admin tokens from URL parameters.",
  "frontend/src/hooks/useActorReadiness.ts": "React hook that wraps useActor to provide UI-gating readiness states (isInitializing, isReady, hasError) with diagnostic logging for actor initialization status.",
  "frontend/src/hooks/useBlobObjectUrl.ts": "React hook that creates and manages Blob/Object URLs from binary data with extensive diagnostic logging, PDF validation, signature-based change detection, and automatic cleanup of revoked URLs.",
  "frontend/src/hooks/useHashRoute.ts": "React hook that manages hash-based routing between 'home' and 'visa-check' routes using window.location.hash with event listeners for hash changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication, managing login/logout flow, identity persistence, and authentication status with configurable AuthClient options.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for user profiles, visa records, and application status operations, wrapping backend actor calls with automatic cache invalidation and loading states.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables defining a design system with navy primary colors, warm neutrals, and comprehensive light/dark theme support.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query and Internet Identity providers, then renders the root App component.",
  "frontend/src/pages/AustralianVisaCheckPage.tsx": "Public visa status check page with blue-themed UI that allows users to search for application status by ID and email using the useCheckApplicationStatus mutation hook with input normalization and comprehensive logging.",
  "frontend/src/pages/DashboardPage.tsx": "Main dashboard page component with tabs for visa records and status management, including forms for adding/editing records and displaying upcoming reminders.",
  "frontend/src/pages/LandingPage.tsx": "Landing page with hero section, feature cards, and call-to-action buttons for login and visa status checking.",
  "frontend/src/utils/anonymousActor.ts": "Creates and caches an anonymous actor for unauthenticated read-only operations using dynamic imports to avoid compile-time dependencies.",
  "frontend/src/utils/applicationStatusNormalization.ts": "Normalizes application status identifiers by trimming whitespace from applicationId and converting applicantEmail to lowercase for consistent backend lookups.",
  "frontend/src/utils/bytesSignature.ts": "Computes deterministic FNV-1a hash signatures from byte arrays with comprehensive validation and diagnostic logging.",
  "frontend/src/utils/candidOption.ts": "Utility functions to unwrap Candid optional encodings and normalize bytes/strings from various formats into standard TypeScript types.",
  "frontend/src/utils/getApplicationStatusResult.ts": "Normalizes raw backend getApplicationStatus responses into properly typed ApplicationStatus objects, ensuring attachment bytes are Uint8Array with extensive logging.",
  "frontend/src/utils/pdfAttachment.ts": "Validates PDF files by checking headers and EOF markers, and provides functions to open PDFs in new tabs or trigger downloads with diagnostic logging.",
  "frontend/src/utils/statusCheckError.ts": "Parses and categorizes errors from status checks into structured error models with user-friendly messages and technical details for debugging.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color schemes using OKLCH, container settings, extended theme properties, animations, and plugin integrations for typography and container queries.",
  "project_state.json": "Project metadata tracking one existing feature to remove the PDF attachment column from ApplicationStatusManager UI while keeping backend PDF storage functionality intact."
}