{
  "backend/main.mo": "Main Motoko actor implementing visa record management, application status tracking with PDF attachments, user profiles, and role-based access control with admin/user permissions.",
  "feature_evidence.json": "Feature evidence report documenting four completed requirements for redesigning AustralianVisaCheckPage to match Australian Government Department of Home Affairs website style with navigation, branding, and functionality.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend source files including components, pages, hooks, and utilities with detailed descriptions of their functionality and recent changes.",
  "frontend/index.css": "Global Tailwind CSS styles with OKLCH-based color system defining light and dark mode variables for UI components, including Australian Government color palette tokens.",
  "frontend/index.html": "HTML entry point for the VisaTrack application with root div and module script reference to main.tsx.",
  "frontend/src/App.tsx": "Root React component implementing hash-based routing with error boundary, handling authentication state, profile setup flow, and conditional rendering of LandingPage, AustralianVisaCheckPage, or DashboardPage.",
  "frontend/src/components/errors/AppErrorBoundary.tsx": "React error boundary component that catches and displays application errors with a user-friendly card UI and refresh button.",
  "frontend/src/components/layout/AppLayout.tsx": "Layout wrapper component providing consistent structure with Header, main content area, and Footer across all pages.",
  "frontend/src/components/layout/Footer.tsx": "Footer component displaying copyright notice and Caffeine.ai attribution with UTM tracking link.",
  "frontend/src/components/layout/Header.tsx": "Application header with logo, Visa Check navigation button, user profile avatar with initials, and login/logout functionality with query cache clearing on logout.",
  "frontend/src/components/profile/ProfileSetupModal.tsx": "Modal dialog for initial user profile setup that prompts for a name and saves it using the useSaveCallerUserProfile hook. Prevents closing until profile is created.",
  "frontend/src/components/reminders/ReminderManager.tsx": "Component for managing visa expiry reminders with preset buttons (30/14/7 days before) and custom date input. Handles adding/removing reminders stored as bigint timestamps.",
  "frontend/src/components/reminders/UpcomingReminders.tsx": "Displays a card showing upcoming reminders for the next 30 days, highlighting overdue items and calculating days until each reminder. Fetches data using useGetUpcomingReminders hook.",
  "frontend/src/components/status/ApplicationStatusManager.tsx": "CRUD interface for managing application status entries with normalization of application IDs and emails. Includes form for creating/editing statuses and list view with edit/delete actions.",
  "frontend/src/components/status/PdfAttachmentSection.tsx": "Displays PDF attachments with iframe preview and download functionality. Includes validation checks, error handling, and diagnostic logging for PDF rendering issues.",
  "frontend/src/components/visa/VisaRecordForm.tsx": "Dialog form for creating and editing visa records with fields for label, grant reference, expiry date, conditions, and integrated ReminderManager component. Handles both create and update mutations.",
  "frontend/src/components/visa/VisaRecordList.tsx": "Displays a list of visa records with edit/delete actions, expiry status badges, and empty state messaging. Uses alert dialogs for delete confirmation and formats dates for Australian locale.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor instance with authentication, initializing it with Internet Identity when available and invalidating dependent queries on actor changes.",
  "frontend/src/hooks/useActorReadiness.ts": "Provides actor initialization state (isInitializing, isReady, hasError) for UI gating with diagnostic logging for debugging actor setup.",
  "frontend/src/hooks/useBlobObjectUrl.ts": "Creates and manages Blob/Object URLs from binary data with signature-based change detection, PDF validation, and extensive diagnostic logging for debugging.",
  "frontend/src/hooks/useHashRoute.ts": "Manages hash-based routing between 'home' and 'visa-check' routes using window.location.hash with event listeners for navigation.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context with login/logout functionality, identity management, and configurable AuthClient options including derivation origin support.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for user profiles, visa records, and application status operations (CRUD) with automatic cache invalidation and actor dependency management.",
  "frontend/src/index.css": "Defines Tailwind CSS configuration with custom color palette using OKLCH color space, including light/dark themes and Australian Government brand colors.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query, Internet Identity provider, and renders the root App component.",
  "frontend/src/pages/AustralianVisaCheckPage.tsx": "Public visa status check page styled to match Australian Government Department of Home Affairs website with dark navy header, coat of arms logo, navigation, and expandable VEVO section containing the visa check form.",
  "frontend/src/pages/DashboardPage.tsx": "Main dashboard page with tabs for managing visa records and application statuses, including upcoming reminders, visa record list, and forms for adding/editing records.",
  "frontend/src/pages/LandingPage.tsx": "Landing page with hero section, feature cards, and call-to-action buttons for login and checking visa status, showcasing the app's key benefits.",
  "frontend/src/utils/anonymousActor.ts": "Creates and caches an anonymous actor for unauthenticated read-only operations like checking application status without requiring Internet Identity login.",
  "frontend/src/utils/applicationStatusNormalization.ts": "Normalizes application status identifiers by trimming whitespace from applicationId and converting applicantEmail to lowercase for consistent backend lookups.",
  "frontend/src/utils/bytesSignature.ts": "Computes a deterministic FNV-1a hash signature from byte arrays with comprehensive diagnostic logging for debugging and validation purposes.",
  "frontend/src/utils/candidOption.ts": "Utility helpers to unwrap Candid optional encodings and normalize bytes/strings from various formats into consistent Uint8Array or string types.",
  "frontend/src/utils/getApplicationStatusResult.ts": "Runtime normalization helper that converts raw backend getApplicationStatus responses into properly typed ApplicationStatus objects with extensive diagnostic logging, especially for attachment bytes.",
  "frontend/src/utils/pdfAttachment.ts": "Provides utilities for validating, opening, and downloading PDF files with extensive diagnostic logging for header/EOF validation and blob operations.",
  "frontend/src/utils/statusCheckError.ts": "Parses and categorizes errors from status checks into connection, backend, or unknown types with user-friendly messages while preserving raw error details.",
  "frontend/src/utils/urlParams.ts": "Handles URL parameter extraction and persistence across hash-based and query-string routing, with sessionStorage integration and parameter cleanup utilities.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom color scheme using OKLCH, government branding colors, extended animations, and typography/container plugins.",
  "project_state.json": "Project metadata tracking visa check website features, including Australian Government styling requirements and reference number/email lookup functionality."
}