{
  "backend/main.mo": "Defines authorization, user profiles, visa records, and application status types with in-memory stores and access-controlled CRUD operations.",
  "feature_evidence.json": "Lists feature evidence entries linking UI features to source files, components, test IDs, and confidence levels.",
  "frontend-file-summaries.txt": "Provides prewritten summaries of multiple frontend files for build or documentation reference.",
  "frontend/index.css": "Tailwind base styles and CSS variables defining color tokens and light/dark mode design system.",
  "frontend/index.html": "Base HTML entrypoint mounting the root React app and loading main.tsx.",
  "frontend/src/App.tsx": "Root React component handling authentication state, routing, and conditional rendering of pages.",
  "frontend/src/components/errors/AppErrorBoundary.tsx": "Error boundary component that displays a fallback UI and logs errors when child components fail.",
  "frontend/src/components/layout/AppLayout.tsx": "Layout wrapper with header, footer, and main content region.",
  "frontend/src/components/layout/Footer.tsx": "Footer component showing copyright text and Caffeine.ai attribution.",
  "frontend/src/components/layout/Header.tsx": "Header with navigation, authentication controls, and user avatar display.",
  "frontend/src/components/profile/ProfileSetupModal.tsx": "Modal for first‑time users to enter and save their display name.",
  "frontend/src/components/reminders/ReminderManager.tsx": "UI component for adding, removing, and listing preset or custom reminder timestamps for a visa expiry date.",
  "frontend/src/components/reminders/UpcomingReminders.tsx": "Fetches upcoming reminders, computes overdue and days-until values, and displays them in a sorted alert list.",
  "frontend/src/components/status/ApplicationStatusManager.tsx": "Manages creation, editing, and deletion of application status entries with optional PDF attachment handling.",
  "frontend/src/components/status/PdfAttachmentSection.tsx": "Displays an attached PDF with preview, view, and download options, or shows a no-attachment message.",
  "frontend/src/components/visa/VisaRecordForm.tsx": "Form dialog for creating or editing visa records including details and reminders, with validation and submission handling.",
  "frontend/src/components/visa/VisaRecordList.tsx": "Lists all visa records with expiry indicators and actions for editing or deleting entries.",
  "frontend/src/hooks/useActor.ts": "Creates a backend actor tied to the user’s identity and refreshes dependent queries when the actor changes.",
  "frontend/src/hooks/useActorReadiness.ts": "Wraps useActor to expose initialization, readiness, and error states for UI gating and debugging.",
  "frontend/src/hooks/useBlobObjectUrl.ts": "Generates and manages a Blob URL from binary data, cleaning it up on unmount or changes.",
  "frontend/src/hooks/useHashRoute.ts": "Implements simple hash‑based routing between 'home' and 'visa-check' with state syncing.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, managing identity loading, login, logout, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for interacting with user profiles, visa records, reminders, and application‑status checks via the actor.",
  "frontend/src/index.css": "Sets Tailwind layers and defines light/dark theme CSS variables for colors, borders, and typography.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentityProvider.",
  "frontend/src/pages/AustralianVisaCheckPage.tsx": "UI for checking visa application status with actor readiness checks, server mutations, and optional PDF preview.",
  "frontend/src/pages/DashboardPage.tsx": "Dashboard displaying visa records, reminders, and application‑status tools with a form for adding or editing records.",
  "frontend/src/pages/LandingPage.tsx": "Landing page UI with hero section, feature cards, login button, and navigation to visa-check route.",
  "frontend/src/utils/applicationStatusNormalization.ts": "Provides helpers to normalize applicationId and applicantEmail for consistent backend lookups.",
  "frontend/src/utils/candidOption.ts": "Utilities to unwrap Candid option formats and normalize bytes and string values.",
  "frontend/src/utils/getApplicationStatusResult.ts": "Transforms raw backend application status responses into a normalized ApplicationStatus object, including attachment cleanup.",
  "frontend/src/utils/pdfAttachment.ts": "Browser utilities for opening, downloading, and generating Blob URLs for PDF attachments.",
  "frontend/src/utils/urlParams.ts": "Helpers for reading, persisting, and clearing URL parameters and session-stored values.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending colors, fonts, animations, and container settings.",
  "project_state.json": "Metadata describing project requirements, known issues, and feature requests for PDF handling in approval flows."
}