{
  "kind": "build_request",
  "title": "Show PDF on approval screen with view and download actions",
  "projectName": "Visa Approval Portal",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "On the approval UI (Application Status Management), when an application status has a PDF attachment, display an inline PDF preview and provide explicit “View PDF” and “Download PDF” actions so approvers can reliably view and download the attached document during approval.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "SHOW THIS PDF ON APPROVAL IT CAN VIEW AND DOWNLOAD"
        ]
      },
      "acceptanceCriteria": [
        "When editing an Application Status that contains an attachment with non-empty bytes, the approval UI shows an “Attached Document” section containing an inline PDF preview (via a Blob URL) and buttons labeled “View PDF” and “Download PDF”.",
        "Clicking “View PDF” opens the PDF in a new tab using the attachment bytes, and clicking “Download PDF” downloads the PDF using the attachment bytes and a .pdf filename.",
        "If the browser cannot render the PDF inline or a Blob URL cannot be created, the UI displays a clear error message and still shows working “View PDF” and “Download PDF” buttons.",
        "When an Application Status has no attachment (or empty bytes), the approval UI shows a clear “No attached document available for this application.” message and does not show preview/actions."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Ensure the public approval/result screen (Australian Visa Status Check) continues to render the PDF attachment section with a preview (when available) and always provides view and download actions for the returned attachment bytes.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "SHOW THIS PDF ON APPROVAL IT CAN VIEW AND DOWNLOAD"
        ]
      },
      "acceptanceCriteria": [
        "When a status lookup returns an attachment with non-empty bytes, the Status Result shows the PDF attachment section with an inline preview (if possible) and buttons labeled “View PDF” and “Download PDF”.",
        "“View PDF” opens a new tab and “Download PDF” downloads the file; both actions work using the bytes returned by the backend.",
        "When a lookup result has no attachment, the Status Result shows the “No attached document available for this application.” message."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/components/ui (compose existing UI components instead).",
    "Do not modify immutable hook/bootstrapping files listed in SYSTEM_CONTEXT (e.g., frontend/src/hooks/useActor.ts, frontend/src/hooks/useInternetIdentity.ts(x), frontend/src/main.tsx).",
    "Keep all backend logic within the single Motoko actor in backend/main.mo; only add backend changes if strictly required for PDF attachment retrieval."
  ],
  "nonGoals": [
    "Adding third-party PDF viewer libraries or external storage services for PDFs.",
    "Changing authentication mechanisms (Internet Identity remains the only auth).",
    "Implementing real-time approval notifications or workflow automation beyond showing/viewing/downloading the existing PDF attachment."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}