{
  "kind": "build_request",
  "title": "Fix blank Australian Visa Status Check outcome (nothing is showing)",
  "projectName": "VisaTrack",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-27",
      "text": "Fix the Australian Visa Status Check flow so that after submitting an Application ID and Applicant Email, the page always renders a visible outcome (found result, “No status found…”, or an error message) and never appears blank to the user.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "nothing is showing"
        ]
      },
      "acceptanceCriteria": [
        "On the Australian Visa Status Check page, submitting the form always results in one of the following becoming visible: (a) “Application Found” result UI, (b) the existing “No status found for that Application ID and email…” message, or (c) the existing error message (“Unable to check application status. Please try again later.”).",
        "If the backend returns no match (Motoko optional null/None/[]), the UI shows the “No status found…” message.",
        "If the request fails (network error, canister error, or thrown exception), the UI shows the existing error message and does not remain blank.",
        "The results card visibility logic is correct even when the mutation resolves to null, resolves to a status object, or rejects."
      ]
    },
    {
      "id": "REQ-28",
      "text": "Ensure unauthenticated users can successfully run the Australian Visa Status Check against the backend and receive the built-in demo status for Application ID \"4906670766\" and applicant email \"jr321134@gmail.com\" (including correct normalization behavior for trimming whitespace and case-insensitive email).",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "nothing is showing"
        ]
      },
      "acceptanceCriteria": [
        "When not signed in, checking Application ID \"4906670766\" with email \"jr321134@gmail.com\" returns and displays an “Application Found” result with applicant name “Rojee Sharma” and status “Work visa approved”.",
        "The lookup works when the user includes leading/trailing spaces in Application ID and/or email, and when the email casing differs (e.g., \"JR321134@GMAIL.COM\").",
        "Unauthenticated callers do not trigger an authorization trap for the check operation, and they still cannot read any user-created application statuses via the public check endpoint (only the built-in demo status is available unauthenticated)."
      ]
    },
    {
      "id": "REQ-29",
      "text": "Add a user-visible fallback for unexpected runtime/render failures so the app does not show a completely blank screen; display an English error message with a simple retry instruction and log the underlying error to the console for debugging.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "nothing is showing"
        ]
      },
      "acceptanceCriteria": [
        "If a runtime error occurs during render of the Australian Visa Status Check page (or its layout), a fallback UI is shown instead of a blank page.",
        "The fallback UI contains a clear English message indicating something went wrong and instructs the user to refresh/retry.",
        "The underlying error is logged to the browser console to aid debugging, without changing existing user-facing copy beyond the new fallback message."
      ]
    }
  ],
  "constraints": [
    "Respect the single-actor backend architecture; keep all Motoko logic in backend/main.mo.",
    "Do not edit files under frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, or frontend/src/components/ui; compose/wrap instead.",
    "Use English for any user-facing text."
  ],
  "nonGoals": [
    "Adding any real government/official integration for visa status checks.",
    "Changing existing product copy on the Visa Status Check page other than introducing a minimal fallback message for unexpected runtime failures.",
    "Introducing external databases, third-party auth providers, websockets, or other unsupported integrations."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}