{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Visa Approval Portal — PDF preview + view/download actions in approval and public result screens",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Add an “Attached Document” section on the approval edit UI that previews a PDF inline (via Blob URL) and provides reliable “View PDF” and “Download PDF” actions with robust fallback/error messaging.",
      "acceptanceCriteria": [
        "When editing an Application Status that contains an attachment with non-empty bytes, the approval UI shows an “Attached Document” section containing an inline PDF preview (via a Blob URL) and buttons labeled “View PDF” and “Download PDF”.",
        "Clicking “View PDF” opens the PDF in a new tab using the attachment bytes, and clicking “Download PDF” downloads the PDF using the attachment bytes and a .pdf filename.",
        "If the browser cannot render the PDF inline or a Blob URL cannot be created, the UI displays a clear error message and still shows working “View PDF” and “Download PDF” buttons.",
        "When an Application Status has no attachment (or empty bytes), the approval UI shows a clear “No attached document available for this application.” message and does not show preview/actions."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/status/ApplicationStatusManager.tsx",
          "operation": "modify",
          "description": "Render the existing PdfAttachmentSection within the edit/create dialog as the “Attached Document” section for the currently-edited ApplicationStatus; use the existing useBlobObjectUrl hook to create the inline preview Blob URL from attachment bytes and pass pdfUrl/pdfUrlError through; wire the section’s “View PDF” and “Download PDF” actions to openPDFInNewTab and downloadPDF using the attachment bytes and a safe .pdf filename. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/utils/pdfAttachment.ts",
          "operation": "modify",
          "description": "Harden attachment view/download helpers for approval-screen usage: ensure filename normalization is consistently applied (always .pdf) and keep error handling predictable so the UI can show a clear message when Blob URL creation/open fails."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Keep the public status result screen’s PDF attachment section showing preview when available and always providing “View PDF” and “Download PDF” actions using returned attachment bytes.",
      "acceptanceCriteria": [
        "When a status lookup returns an attachment with non-empty bytes, the Status Result shows the PDF attachment section with an inline preview (if possible) and buttons labeled “View PDF” and “Download PDF”.",
        "“View PDF” opens a new tab and “Download PDF” downloads the file; both actions work using the bytes returned by the backend.",
        "When a lookup result has no attachment, the Status Result shows the “No attached document available for this application.” message."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/AustralianVisaCheckPage.tsx",
          "operation": "modify",
          "description": "Confirm and enforce that Status Result always renders PdfAttachmentSection and that View/Download handlers always use backend-returned attachment bytes with a safe default .pdf filename; ensure any Blob URL creation failure is surfaced via pdfUrlError so the section shows the fallback error message while keeping actions working. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/status/PdfAttachmentSection.tsx",
          "operation": "modify",
          "description": "Ensure PdfAttachmentSection behavior matches acceptance criteria: show the exact “No attached document available for this application.” message when bytes are empty/missing; when bytes exist, always render “View PDF” and “Download PDF” buttons even if pdfUrl is missing or pdfUrlError is present, and display a clear preview error message when pdfUrl cannot be created. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}