{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Redesign website to match Australian Government visa check interface",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Redesign the AustralianVisaCheckPage to match the Australian Government Department of Home Affairs website style with dark blue header, coat of arms logo, navigation menu, and search icon",
      "acceptanceCriteria": [
        "Page header uses dark navy blue (#002554 or similar) matching the government website",
        "Australian Government coat of arms logo is displayed in the header",
        "Header includes 'Department of Home Affairs' text",
        "Header includes hamburger menu icon and search icon on appropriate sides",
        "Navigation breadcrumbs display below header (Home > Visas > When you have a visa)"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/AustralianVisaCheckPage.tsx",
          "operation": "modify",
          "description": "Replace the existing header structure with a government-styled header featuring dark navy blue background (#002554), Australian Government coat of arms logo at frontend/public/assets/generated/aus-govt-logo.dim_200x80.png, 'Australian Government' and 'Department of Home Affairs' text, hamburger menu icon (left), and search icon (right). Add breadcrumb navigation below the header displaying 'Home > Visas > When you have a visa'. Verify the generated logo component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/AustralianVisaCheckPage.tsx",
          "operation": "modify",
          "description": "Restructure the page to remove the existing AppLayout wrapper and implement the government website layout directly in this component, including the new header, navigation links section, and main content area to match the reference design."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Update the main content area to use bright blue background with the heading 'Check visa details and conditions' in large white text",
      "acceptanceCriteria": [
        "Main content area uses bright blue background matching the reference image",
        "Heading text 'Check visa details and conditions' is displayed in large white font",
        "Content section includes expandable/collapsible 'Check conditions online (VEVO)' section with dropdown arrow"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/AustralianVisaCheckPage.tsx",
          "operation": "modify",
          "description": "Replace the existing main content section background with bright blue (#006CB5). Change the main heading to 'Check visa details and conditions' styled in large white text. Add an expandable/collapsible section labeled 'Check conditions online (VEVO)' with a dropdown arrow icon that toggles visibility of the visa check form content."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Maintain the existing functionality to check visa application status using reference number and email with prominent, clearly labeled input fields",
      "acceptanceCriteria": [
        "Reference number input field is clearly visible and labeled",
        "Email input field is clearly visible and labeled",
        "Search/Check button is prominently displayed",
        "Existing normalization logic for applicationId and email is preserved",
        "useCheckApplicationStatus mutation hook continues to function correctly"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/AustralianVisaCheckPage.tsx",
          "operation": "modify",
          "description": "Preserve the existing form inputs (applicationId and email) and the check button, ensuring they remain prominently displayed and clearly labeled. Keep all existing normalization logic from applicationStatusNormalization.ts and the useCheckApplicationStatus mutation hook integration intact. Style the form controls to fit within the new government design theme while maintaining full functionality."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Add navigation links in the header area matching the government website style for ImmiAccount, VEVO, and My Tourist Refund Scheme",
      "acceptanceCriteria": [
        "Three navigation links are displayed below the main header",
        "Links are styled with white text on the dark blue background",
        "Links maintain consistent spacing and alignment"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/AustralianVisaCheckPage.tsx",
          "operation": "modify",
          "description": "Add a navigation section immediately below the main header containing three links: 'ImmiAccount', 'Visa Entitlement Verification Online (VEVO)', and 'My Tourist Refund Scheme (TRS)'. Style these links with white text on dark blue background matching the header, with consistent horizontal spacing and alignment. These links are non-functional placeholders matching the visual design of the reference website."
        }
      ]
    }
  ]
}